import 'package:flutter/services.dart';
import 'package:gradient_app_bar/gradient_app_bar.dart';

import 'package:flutter/material.dart';
import 'package:wellness/dashboard/app_theme.dart';

class DisclaimerPage extends StatefulWidget {
  @override
  _DisclaimerPageState createState() => _DisclaimerPageState();
}

class _DisclaimerPageState extends State<DisclaimerPage> {
  final TextStyle header = TextStyle(
    color: Colors.black,
    fontSize: 20,
    fontFamily: 'Kanit',
    fontWeight: FontWeight.bold,
  );

  final TextStyle paragraph = TextStyle(
    fontSize: 16,
    fontFamily: 'Kanit',
    color: Colors.grey[800],
  );

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: GradientAppBar(
        title: Text('Disclaimer'),
        gradient: LinearGradient(
            colors: [AppTheme.appBarColor1, AppTheme.appBarColor2]),
      ),
      body: Padding(
        padding: const EdgeInsets.fromLTRB(10, 0, 10, 16),
        child: ListView(
          children: <Widget>[
            RichText(
                text: TextSpan(children: <TextSpan>[
              TextSpan(
                text: '\nสถานะทางกฎหมายของข้อมูลด้านสุขภาพ\n\n',
                style: header,
              ),
              TextSpan(
                text:
                    '      ข้อมูลเกี่ยวกับสุขภาพ ประวัติการรักษาพยาบาลของบุคคล มีสถานะเป็นข้อมูลข่าวสาร   ส่วนบุคคล และเป็นความลับส่วนบุคคล ตาม\n',
                style: paragraph,
              ),
              TextSpan(
                text:
                    '      ๑. มาตรา ๔ บทนิยาม แห่งพระราชบัญญัติข้อมูลข่าวสารของราชการ พ.ศ. ๒๕๔๐ ที่บัญญัติว่า “ข้อมูลข่าวสารส่วนบุคคล” หมายความว่า ข้อมูลข่าวสารเกี่ยวกับสิ่งเฉพาะตัวของบุคคล เช่น ฯลฯ ประวัติสุขภาพ ฯลฯ ...” \n',
                style: paragraph,
              ),
              TextSpan(
                  text:
                      '      ๒. มาตรา ๗ แห่งพระราชบัญญัติสุขภาพแห่งชาติ พ.ศ. ๒๕๕๐ ที่บัญญัติว่า “ข้อมูลด้านสุขภาพของบุคคล เป็นความลับส่วนบุคคล ผู้ใดจะนำไปเปิดเผยในประการที่น่าจะทำให้บุคคลนั้นเสียหายไม่ได้ เว้นแต่การเปิดเผยนั้นเป็นไปตามความประสงค์ของบุคคลนั้นโดยตรง หรือมีกฎหมายเฉพาะบัญญัติให้ต้องเปิดเผย แต่ไม่ว่ากรณีใด ๆ ผู้ใดจะอาศัยอำนาจหรือสิทธิตามกฎหมายว่าด้วยข้อมูลข่าวสารของราชการ หรือกฎหมายอื่นเพื่อขอเอกสารเกี่ยวกับข้อมูลด้านสุขภาพของบุคคลที่ไม่ใช่ของตนไม่ได้”\n',
                  style: paragraph),
              TextSpan(
                text:
                    '      ๓. ข้อ ๔ บทนิยาม แห่งระเบียบกระทรวงสาธารณสุข ว่าด้วยการคุ้มครองและจัดการข้อมูลด้านสุขภาพของบุคคล พ.ศ. ๒๕๖๑ ที่กำหนดว่า “ข้อมูลด้านสุขภาพของบุคคล หมายความว่า ข้อมูลหรือ สิ่งใด ๆ ที่แสดงออกมาในรูปเอกสาร แฟ้ม ฯลฯ หรือวิธีอื่นใดที่ทำให้สิ่งที่บันทึกไว้ปรากฏขึ้นในเรื่องที่เกี่ยวกับสุขภาพของบุคคลที่สามารถระบุตัวบุคคลได้”\n',
                style: paragraph,
              ),
              TextSpan(
                text: '\n\nการเปิดเผยข้อมูลด้านสุขภาพ\n\n',
                style: header,
              ),
              TextSpan(
                text:
                    '      การเปิดเผยข้อมูลเกี่ยวกับสุขภาพ ซึ่งเป็นข้อมูลข่าวสารส่วนบุคคล และเป็นความลับส่วนบุคคล ต้องปฏิบัติตามกฎหมาย ดังนี้\n',
                style: paragraph,
              ),
              TextSpan(
                text:
                    '      ๑. มาตรา ๒๔ บทนิยาม แห่งพระราชบัญญัติข้อมูลข่าวสารของราชการ พ.ศ. ๒๕๔๐ ที่บัญญัติว่า “หน่วยงานของรัฐจะเปิดเผยข้อมูลข่าวสารส่วนบุคคลที่อยู่ในความควบคุมดูแลของตน ต่อหน่วยงานของรัฐแห่งอื่น หรือผู้อื่น โดยปราศจากความยินยอมเป็นหนังสือของเจ้าของข้อมูลที่ให้ไว้ล่วงหน้า หรือในขณะนั้นมิได้...”\n',
                style: paragraph,
              ),
              TextSpan(
                text: '      ๒. พระราชบัญญัติสุขภาพแห่งชาติ พ.ศ. ๒๕๕๐ \n',
                style: paragraph,
              ),
              TextSpan(
                text:
                    '      “มาตรา ๑๙ ผู้ควบคุมข้อมูลส่วนบุคคลจะกระทำการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลไม่ได้หากเจ้าของข้อมูลส่วนบุคคลไม่ได้ให้ความยินยอมไว้ก่อน หรือในขณะนั้น \n',
                style: paragraph,
              ),
              TextSpan(
                text:
                    '      การขอความยินยอมต้องทำโดยชัดแจ้ง เป็นหนังสือหรือทำโดยผ่านระบบอิเล็กทรอนิกส์ เว้นแต่โดยสภาพไม่อาจขอความยินยอมด้วยวิธีการดังกล่าวได้\n',
                style: paragraph,
              ),
              TextSpan(
                text:
                    '      ในการขอความยินยอมจากเจ้าของข้อมูลส่วนบุคคล ผู้ควบคุมข้อมูลส่วนบุคคลต้องแจ้งวัตถุประสงค์ของการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลไปด้วย และการขอความยินยอมนั้น ต้องแยกส่วนออกจากข้อความอื่นอย่างชัดเจน มีแบบหรือข้อความที่เข้าถึงได้ง่ายและเข้าใจได้ รวมทั้งใช้ภาษาที่อ่านง่าย....”\n',
                style: paragraph,
              ),
              TextSpan(
                text:
                    '      “มาตรา ๒๐ ในกรณีที่เจ้าของข้อมูลส่วนบุคคลเป็นผู้เยาว์ซึ่งยังไม่บรรลุนิติภาวะ... ต้องได้รับความยินยอมจากผู้ใช้อำนาจปกครองที่มีอำนาจกระทำการแทนผู้เยาว์ด้วย....\n',
                style: paragraph,
              ),
              TextSpan(
                text:
                    '      ในกรณีที่เจ้าของข้อมูลส่วนบุคคลเป็นคนไร้ความสามารถ... ให้ขอความยินยอมจากผู้อนุบาลที่มีอำนาจกระทำการแทนคนไร้ความสามารถ\n',
                style: paragraph,
              ),
              TextSpan(
                text:
                    '      ในกรณีที่เจ้าของข้อมูลส่วนบุคคลเป็นคนเสมือนไร้ความสามารถ... ให้ขอความยินยอมจาก   ผู้พิทักษ์ที่มีอำนาจกระทำการแทนคนเสมือนไร้ความสามารถ”\n',
                style: paragraph,
              ),
              TextSpan(
                text:
                    '      “มาตรา ๒๑ ผู้ควบคุมข้อมูลส่วนบุคคลต้องทำการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลตามวัตถุประสง์ที่ได้แจ้งเจ้าของข้อมูลส่วนบุคคลไว้ก่อนหรือในขณะที่เก็บรวบรวม”\n',
                style: paragraph,
              ),
              TextSpan(
                text:
                    '      ๓. ระเบียบกระทรวงสาธารณสุข ว่าด้วยการคุ้มครองและจัดการข้อมูลด้านสุขภาพของบุคคล พ.ศ. ๒๕๖๑ \n',
                style: paragraph,
              ),
              TextSpan(
                text:
                    '      “ข้อ ๑๓ ข้อมูลด้านสุขภาพของบุคคลเป็นความลับส่วนบุคคล จะเปิดเผยได้ต่อเมื่อได้รับความยินยอมจากเจ้าของข้อมูล หรือผู้มีอำนาจกระทำการแทน...” \n',
                style: paragraph,
              ),
              TextSpan(
                text:
                    '      “ข้อ ๒๑ ผู้ควบคุมข้อมูล อาจขอให้เจ้าของข้อมูลให้ความยินยอมล่วงหน้าในการเปิดเผยข้อมูลด้านสุขภาพของบุคคคล ในกรณีดังต่อไปนี้\n',
                style: paragraph,
              ),
              TextSpan(
                text:
                    '      (1) ต่อบุคลากรทางการแพทย์ของผู้ควบคุมข้อมูลในการปฏิบัติงานในหน้าที่ หรือเพื่อประโยชน์ของเจ้าของข้อมูล\n',
                style: paragraph,
              ),
              TextSpan(
                text:
                    '      (2) เพื่อประโยชน์ในการศึกษาวิจัยโดยไม่ระบุชื่อ หรือส่วนที่ทำให้รู้ว่าเป็นข้อมูลด้านสุขภาพของบุคคลใด\n',
                style: paragraph,
              ),
              TextSpan(
                text:
                    '      (3) เป็นการจำเป็นเพื่อการป้องกัน หรือระงับอันตรายต่อชีวิต หรือสุขภาพของ\n',
                style: paragraph,
              ),
              TextSpan(
                text:
                    '      (4) มีเหตุจำเป็นอื่น ๆ เพื่อประโยชน์ของเจ้าของข้อมูล”\n',
                style: paragraph,
              ),
              TextSpan(
                text:
                    '\n\nแบบฟอร์มแสดงเจตนายินยอมให้เปิดเผยข้อมูลด้านสุขภาพของบุคคลทางอิเล็กทรอสิกส์\n\n',
                style: header,
              ),
              TextSpan(
                text:
                    '      ข้าพเจ้าในฐานะ ผู้ป่วย หรือ ผู้มีอํานาจกระทําแทนผู้ป่วย ได้รับทราบวัตถุประสงค์ในการให้คํายินยอมเพื่อการแลกเปลี่ยนข้อมูลระหว่างสถานพยาบาล โดยสามารถนําข้อมูลระดับบุคคล ไปใช้ประโยชน์ในการบริการดูแลสุขภาพ อาทิการจัดเก็บข้อมูลการตรวจรักษา/การผ่าตัด/การใช้ยา/ตรวจรักษาทาง รังสีและกระทําหัตถการ ทั้งนี้รวมถึงความเสี่ยงผลข้างเคียงและภาวะแทรกซ้อนไว้โดยวิธีการทางอิเล็กทรอนิกส์ เพื่อประโยชน์ในการดูแลสุขภาพของข้าพเจ้าแล้ว \n',
                style: paragraph,
              ),
              TextSpan(
                text:
                    '      ข้าพเจ้ายินยอมให้สถานพยาบาลเปิดเผยข้อมูล/ส่งข้อมูล ทางอิเล็กทรอนิกส์ (สําเนาข้อมูล) เพื่อ การรักษาพยาบาลแก่ผู้ประกอบวิชาชีพด้านสาธารณสุข (บุคลากรที่ได้รับอนุญาตในการรักษาพยาบาล) และ สถานพยาบาลที่ให้บริการรักษาได้\n',
                style: paragraph,
              ),
              TextSpan(
                text:
                    '      หากสถานพยาบาลนําข้อมูลสุขภาพส่วนบุคคลของข้าพเจ้าไปใช้เพื่อการอื่นใดอันไม่เป็นประโยชน์ต่อการ รักษาพยาบาล ต้องได้รับคํายินยอมจากข้าพเจ้าเว้นแต่การเปิดเผยตามที่กฎหมายบัญญัติหรือมีคําสั่งศาลให้เปิดเผย\n',
                style: paragraph,
              ),
              TextSpan(
                text:
                    '      ข้าพเจ้า สามารถยกเลิกความยินยอมได้แต่ไม่มีผลลบล้างความยินยอมและผลแห่ง  ความยินยอม ซึ่งได้ กระทําไปแล้วก่อนหน้านั้น โดยการยกเลิกความยินยอมต้องมีหลักฐานเป็นลายลักษณ์อักษรลงลายมือชื่อข้าพเจ้า หรือผู้มีอํานาจกระทําแทน ผู้แทนสถานพยาบาล และพยาน\n',
                style: paragraph,
              ),
            ])),
            Padding(
              padding: const EdgeInsets.fromLTRB(16, 30, 16, 8),
              child: RaisedButton(
                elevation: 2.0,
                onPressed: _accept,
                padding: EdgeInsets.all(12),
                color: AppTheme.buttonColor,
                child: Text('ยินยอมและเข้าสู่โปรแกรม',
                    style: TextStyle(color: Colors.white, fontSize: 16)),
              ),
            ),
            Padding(
              padding: const EdgeInsets.fromLTRB(16, 8, 16, 24),
              child: RaisedButton(
                elevation: 2.0,
                onPressed: _notaccept,
                padding: EdgeInsets.all(12),
                color: Colors.grey,
                child: Text('ไม่ยินยอม',
                    style: TextStyle(color: Colors.white, fontSize: 16)),
              ),
            )
          ],
        ),
      ),
    );
  }

  _accept() {
    Navigator.pushReplacementNamed(context, '/login');
  }

  _notaccept() {
    SystemNavigator.pop();
  }
}
